#map = affine_map<(d0, d1, d2) -> (d1)>
#map1 = affine_map<(d0, d1, d2) -> (d0, d2)>
#map2 = affine_map<(d0, d1, d2) -> (d0, d1)>
#map3 = affine_map<(d0, d1) -> (d0, d1)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map5 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map6 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map7 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map8 = affine_map<(d0, d1, d2) -> (d0, 0, d1, d2)>
#map9 = affine_map<(d0, d1) -> (0, d0, d1)>
module {
  func.func @prefill_forward(%arg0: tensor<4096xf32>, %arg1: tensor<4096xf32>, %arg2: tensor<4096xf32>, %arg3: tensor<4096xf32>, %arg4: tensor<4096xf32>, %arg5: tensor<4096xf32>, %arg6: tensor<4096xf32>, %arg7: tensor<4096xf32>, %arg8: tensor<4096xf32>, %arg9: tensor<4096xf32>, %arg10: tensor<4096xf32>, %arg11: tensor<4096xf32>, %arg12: tensor<4096xf32>, %arg13: tensor<4096xf32>, %arg14: tensor<4096xf32>, %arg15: tensor<4096xf32>, %arg16: tensor<4096xf32>, %arg17: tensor<4096xf32>, %arg18: tensor<4096xf32>, %arg19: tensor<4096xf32>, %arg20: tensor<4096xf32>, %arg21: tensor<4096xf32>, %arg22: tensor<4096xf32>, %arg23: tensor<4096xf32>, %arg24: tensor<4096xf32>, %arg25: tensor<4096xf32>, %arg26: tensor<4096xf32>, %arg27: tensor<4096xf32>, %arg28: tensor<4096xf32>, %arg29: tensor<4096xf32>, %arg30: tensor<4096xf32>, %arg31: tensor<4096xf32>, %arg32: tensor<4096xf32>, %arg33: tensor<4096xf32>, %arg34: tensor<4096xf32>, %arg35: tensor<4096xf32>, %arg36: tensor<4096xf32>, %arg37: tensor<4096xf32>, %arg38: tensor<4096xf32>, %arg39: tensor<4096xf32>, %arg40: tensor<4096xf32>, %arg41: tensor<4096xf32>, %arg42: tensor<4096xf32>, %arg43: tensor<4096xf32>, %arg44: tensor<4096xf32>, %arg45: tensor<4096xf32>, %arg46: tensor<4096xf32>, %arg47: tensor<4096xf32>, %arg48: tensor<4096xf32>, %arg49: tensor<4096xf32>, %arg50: tensor<4096xf32>, %arg51: tensor<4096xf32>, %arg52: tensor<4096xf32>, %arg53: tensor<4096xf32>, %arg54: tensor<4096xf32>, %arg55: tensor<4096xf32>, %arg56: tensor<4096xf32>, %arg57: tensor<4096xf32>, %arg58: tensor<4096xf32>, %arg59: tensor<4096xf32>, %arg60: tensor<4096xf32>, %arg61: tensor<4096xf32>, %arg62: tensor<4096xf32>, %arg63: tensor<4096xf32>, %arg64: tensor<4096xf32>, %arg65: tensor<32000x4096xf32>, %arg66: tensor<4096x4096xf32>, %arg67: tensor<4096x4096xf32>, %arg68: tensor<4096x4096xf32>, %arg69: tensor<4096x4096xf32>, %arg70: tensor<11008x4096xf32>, %arg71: tensor<11008x4096xf32>, %arg72: tensor<4096x11008xf32>, %arg73: tensor<4096x4096xf32>, %arg74: tensor<4096x4096xf32>, %arg75: tensor<4096x4096xf32>, %arg76: tensor<4096x4096xf32>, %arg77: tensor<11008x4096xf32>, %arg78: tensor<11008x4096xf32>, %arg79: tensor<4096x11008xf32>, %arg80: tensor<4096x4096xf32>, %arg81: tensor<4096x4096xf32>, %arg82: tensor<4096x4096xf32>, %arg83: tensor<4096x4096xf32>, %arg84: tensor<11008x4096xf32>, %arg85: tensor<11008x4096xf32>, %arg86: tensor<4096x11008xf32>, %arg87: tensor<4096x4096xf32>, %arg88: tensor<4096x4096xf32>, %arg89: tensor<4096x4096xf32>, %arg90: tensor<4096x4096xf32>, %arg91: tensor<11008x4096xf32>, %arg92: tensor<11008x4096xf32>, %arg93: tensor<4096x11008xf32>, %arg94: tensor<4096x4096xf32>, %arg95: tensor<4096x4096xf32>, %arg96: tensor<4096x4096xf32>, %arg97: tensor<4096x4096xf32>, %arg98: tensor<11008x4096xf32>, %arg99: tensor<11008x4096xf32>, %arg100: tensor<4096x11008xf32>, %arg101: tensor<4096x4096xf32>, %arg102: tensor<4096x4096xf32>, %arg103: tensor<4096x4096xf32>, %arg104: tensor<4096x4096xf32>, %arg105: tensor<11008x4096xf32>, %arg106: tensor<11008x4096xf32>, %arg107: tensor<4096x11008xf32>, %arg108: tensor<4096x4096xf32>, %arg109: tensor<4096x4096xf32>, %arg110: tensor<4096x4096xf32>, %arg111: tensor<4096x4096xf32>, %arg112: tensor<11008x4096xf32>, %arg113: tensor<11008x4096xf32>, %arg114: tensor<4096x11008xf32>, %arg115: tensor<4096x4096xf32>, %arg116: tensor<4096x4096xf32>, %arg117: tensor<4096x4096xf32>, %arg118: tensor<4096x4096xf32>, %arg119: tensor<11008x4096xf32>, %arg120: tensor<11008x4096xf32>, %arg121: tensor<4096x11008xf32>, %arg122: tensor<4096x4096xf32>, %arg123: tensor<4096x4096xf32>, %arg124: tensor<4096x4096xf32>, %arg125: tensor<4096x4096xf32>, %arg126: tensor<11008x4096xf32>, %arg127: tensor<11008x4096xf32>, %arg128: tensor<4096x11008xf32>, %arg129: tensor<4096x4096xf32>, %arg130: tensor<4096x4096xf32>, %arg131: tensor<4096x4096xf32>, %arg132: tensor<4096x4096xf32>, %arg133: tensor<11008x4096xf32>, %arg134: tensor<11008x4096xf32>, %arg135: tensor<4096x11008xf32>, %arg136: tensor<4096x4096xf32>, %arg137: tensor<4096x4096xf32>, %arg138: tensor<4096x4096xf32>, %arg139: tensor<4096x4096xf32>, %arg140: tensor<11008x4096xf32>, %arg141: tensor<11008x4096xf32>, %arg142: tensor<4096x11008xf32>, %arg143: tensor<4096x4096xf32>, %arg144: tensor<4096x4096xf32>, %arg145: tensor<4096x4096xf32>, %arg146: tensor<4096x4096xf32>, %arg147: tensor<11008x4096xf32>, %arg148: tensor<11008x4096xf32>, %arg149: tensor<4096x11008xf32>, %arg150: tensor<4096x4096xf32>, %arg151: tensor<4096x4096xf32>, %arg152: tensor<4096x4096xf32>, %arg153: tensor<4096x4096xf32>, %arg154: tensor<11008x4096xf32>, %arg155: tensor<11008x4096xf32>, %arg156: tensor<4096x11008xf32>, %arg157: tensor<4096x4096xf32>, %arg158: tensor<4096x4096xf32>, %arg159: tensor<4096x4096xf32>, %arg160: tensor<4096x4096xf32>, %arg161: tensor<11008x4096xf32>, %arg162: tensor<11008x4096xf32>, %arg163: tensor<4096x11008xf32>, %arg164: tensor<4096x4096xf32>, %arg165: tensor<4096x4096xf32>, %arg166: tensor<4096x4096xf32>, %arg167: tensor<4096x4096xf32>, %arg168: tensor<11008x4096xf32>, %arg169: tensor<11008x4096xf32>, %arg170: tensor<4096x11008xf32>, %arg171: tensor<4096x4096xf32>, %arg172: tensor<4096x4096xf32>, %arg173: tensor<4096x4096xf32>, %arg174: tensor<4096x4096xf32>, %arg175: tensor<11008x4096xf32>, %arg176: tensor<11008x4096xf32>, %arg177: tensor<4096x11008xf32>, %arg178: tensor<4096x4096xf32>, %arg179: tensor<4096x4096xf32>, %arg180: tensor<4096x4096xf32>, %arg181: tensor<4096x4096xf32>, %arg182: tensor<11008x4096xf32>, %arg183: tensor<11008x4096xf32>, %arg184: tensor<4096x11008xf32>, %arg185: tensor<4096x4096xf32>, %arg186: tensor<4096x4096xf32>, %arg187: tensor<4096x4096xf32>, %arg188: tensor<4096x4096xf32>, %arg189: tensor<11008x4096xf32>, %arg190: tensor<11008x4096xf32>, %arg191: tensor<4096x11008xf32>, %arg192: tensor<4096x4096xf32>, %arg193: tensor<4096x4096xf32>, %arg194: tensor<4096x4096xf32>, %arg195: tensor<4096x4096xf32>, %arg196: tensor<11008x4096xf32>, %arg197: tensor<11008x4096xf32>, %arg198: tensor<4096x11008xf32>, %arg199: tensor<4096x4096xf32>, %arg200: tensor<4096x4096xf32>, %arg201: tensor<4096x4096xf32>, %arg202: tensor<4096x4096xf32>, %arg203: tensor<11008x4096xf32>, %arg204: tensor<11008x4096xf32>, %arg205: tensor<4096x11008xf32>, %arg206: tensor<4096x4096xf32>, %arg207: tensor<4096x4096xf32>, %arg208: tensor<4096x4096xf32>, %arg209: tensor<4096x4096xf32>, %arg210: tensor<11008x4096xf32>, %arg211: tensor<11008x4096xf32>, %arg212: tensor<4096x11008xf32>, %arg213: tensor<4096x4096xf32>, %arg214: tensor<4096x4096xf32>, %arg215: tensor<4096x4096xf32>, %arg216: tensor<4096x4096xf32>, %arg217: tensor<11008x4096xf32>, %arg218: tensor<11008x4096xf32>, %arg219: tensor<4096x11008xf32>, %arg220: tensor<4096x4096xf32>, %arg221: tensor<4096x4096xf32>, %arg222: tensor<4096x4096xf32>, %arg223: tensor<4096x4096xf32>, %arg224: tensor<11008x4096xf32>, %arg225: tensor<11008x4096xf32>, %arg226: tensor<4096x11008xf32>, %arg227: tensor<4096x4096xf32>, %arg228: tensor<4096x4096xf32>, %arg229: tensor<4096x4096xf32>, %arg230: tensor<4096x4096xf32>, %arg231: tensor<11008x4096xf32>, %arg232: tensor<11008x4096xf32>, %arg233: tensor<4096x11008xf32>, %arg234: tensor<4096x4096xf32>, %arg235: tensor<4096x4096xf32>, %arg236: tensor<4096x4096xf32>, %arg237: tensor<4096x4096xf32>, %arg238: tensor<11008x4096xf32>, %arg239: tensor<11008x4096xf32>, %arg240: tensor<4096x11008xf32>, %arg241: tensor<4096x4096xf32>, %arg242: tensor<4096x4096xf32>, %arg243: tensor<4096x4096xf32>, %arg244: tensor<4096x4096xf32>, %arg245: tensor<11008x4096xf32>, %arg246: tensor<11008x4096xf32>, %arg247: tensor<4096x11008xf32>, %arg248: tensor<4096x4096xf32>, %arg249: tensor<4096x4096xf32>, %arg250: tensor<4096x4096xf32>, %arg251: tensor<4096x4096xf32>, %arg252: tensor<11008x4096xf32>, %arg253: tensor<11008x4096xf32>, %arg254: tensor<4096x11008xf32>, %arg255: tensor<4096x4096xf32>, %arg256: tensor<4096x4096xf32>, %arg257: tensor<4096x4096xf32>, %arg258: tensor<4096x4096xf32>, %arg259: tensor<11008x4096xf32>, %arg260: tensor<11008x4096xf32>, %arg261: tensor<4096x11008xf32>, %arg262: tensor<4096x4096xf32>, %arg263: tensor<4096x4096xf32>, %arg264: tensor<4096x4096xf32>, %arg265: tensor<4096x4096xf32>, %arg266: tensor<11008x4096xf32>, %arg267: tensor<11008x4096xf32>, %arg268: tensor<4096x11008xf32>, %arg269: tensor<4096x4096xf32>, %arg270: tensor<4096x4096xf32>, %arg271: tensor<4096x4096xf32>, %arg272: tensor<4096x4096xf32>, %arg273: tensor<11008x4096xf32>, %arg274: tensor<11008x4096xf32>, %arg275: tensor<4096x11008xf32>, %arg276: tensor<4096x4096xf32>, %arg277: tensor<4096x4096xf32>, %arg278: tensor<4096x4096xf32>, %arg279: tensor<4096x4096xf32>, %arg280: tensor<11008x4096xf32>, %arg281: tensor<11008x4096xf32>, %arg282: tensor<4096x11008xf32>, %arg283: tensor<4096x4096xf32>, %arg284: tensor<4096x4096xf32>, %arg285: tensor<4096x4096xf32>, %arg286: tensor<4096x4096xf32>, %arg287: tensor<11008x4096xf32>, %arg288: tensor<11008x4096xf32>, %arg289: tensor<4096x11008xf32>, %arg290: tensor<32000x4096xf32>, %arg291: tensor<1x1x2048x128xf32>, %arg292: tensor<1x1x2048x128xf32>, %arg293: tensor<1x1x2048x128xf32>, %arg294: tensor<1x1x2048x128xf32>, %arg295: tensor<1x1x2048x128xf32>, %arg296: tensor<1x1x2048x128xf32>, %arg297: tensor<1x1x2048x128xf32>, %arg298: tensor<1x1x2048x128xf32>, %arg299: tensor<1x1x2048x128xf32>, %arg300: tensor<1x1x2048x128xf32>, %arg301: tensor<1x1x2048x128xf32>, %arg302: tensor<1x1x2048x128xf32>, %arg303: tensor<1x1x2048x128xf32>, %arg304: tensor<1x1x2048x128xf32>, %arg305: tensor<1x1x2048x128xf32>, %arg306: tensor<1x1x2048x128xf32>, %arg307: tensor<1x1x2048x128xf32>, %arg308: tensor<1x1x2048x128xf32>, %arg309: tensor<1x1x2048x128xf32>, %arg310: tensor<1x1x2048x128xf32>, %arg311: tensor<1x1x2048x128xf32>, %arg312: tensor<1x1x2048x128xf32>, %arg313: tensor<1x1x2048x128xf32>, %arg314: tensor<1x1x2048x128xf32>, %arg315: tensor<1x1x2048x128xf32>, %arg316: tensor<1x1x2048x128xf32>, %arg317: tensor<1x1x2048x128xf32>, %arg318: tensor<1x1x2048x128xf32>, %arg319: tensor<1x1x2048x128xf32>, %arg320: tensor<1x1x2048x128xf32>, %arg321: tensor<1x1x2048x128xf32>, %arg322: tensor<1x1x2048x128xf32>, %arg323: tensor<1x1x2048x128xf32>, %arg324: tensor<1x1x2048x128xf32>, %arg325: tensor<1x1x2048x128xf32>, %arg326: tensor<1x1x2048x128xf32>, %arg327: tensor<1x1x2048x128xf32>, %arg328: tensor<1x1x2048x128xf32>, %arg329: tensor<1x1x2048x128xf32>, %arg330: tensor<1x1x2048x128xf32>, %arg331: tensor<1x1x2048x128xf32>, %arg332: tensor<1x1x2048x128xf32>, %arg333: tensor<1x1x2048x128xf32>, %arg334: tensor<1x1x2048x128xf32>, %arg335: tensor<1x1x2048x128xf32>, %arg336: tensor<1x1x2048x128xf32>, %arg337: tensor<1x1x2048x128xf32>, %arg338: tensor<1x1x2048x128xf32>, %arg339: tensor<1x1x2048x128xf32>, %arg340: tensor<1x1x2048x128xf32>, %arg341: tensor<1x1x2048x128xf32>, %arg342: tensor<1x1x2048x128xf32>, %arg343: tensor<1x1x2048x128xf32>, %arg344: tensor<1x1x2048x128xf32>, %arg345: tensor<1x1x2048x128xf32>, %arg346: tensor<1x1x2048x128xf32>, %arg347: tensor<1x1x2048x128xf32>, %arg348: tensor<1x1x2048x128xf32>, %arg349: tensor<1x1x2048x128xf32>, %arg350: tensor<1x1x2048x128xf32>, %arg351: tensor<1x1x2048x128xf32>, %arg352: tensor<1x1x2048x128xf32>, %arg353: tensor<1x1x2048x128xf32>, %arg354: tensor<1x1x2048x128xf32>, %arg355: tensor<1x6xi64>) -> (tensor<1x6x32000xf32>, tensor<1x6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>, tensor<6x4096xf32>) {
    %0 = "tosa.const"() <{value = dense<[0, 1, 2, 3, 4, 5]> : tensor<6xi64>}> : () -> tensor<6xi64>
    %1 = tosa.reshape %0 {new_shape = array<i64: 1, 6>} : (tensor<6xi64>) -> tensor<1x6xi64>
    %2 = tosa.reshape %1 {new_shape = array<i64: 1, 6>} : (tensor<1x6xi64>) -> tensor<1x6xi64>
    %3 = tosa.cast %arg355 : (tensor<1x6xi64>) -> tensor<1x6xi32>
    %4 = tosa.reshape %arg65 {new_shape = array<i64: 1, 32000, 4096>} : (tensor<32000x4096xf32>) -> tensor<1x32000x4096xf32>
    %5 = tosa.gather %4, %3 : (tensor<1x32000x4096xf32>, tensor<1x6xi32>) -> tensor<1x6x4096xf32>
    %6 = tosa.reshape %5 {new_shape = array<i64: 1, 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %cst = arith.constant dense<true> : tensor<1x6xi1>
    %cst_0 = arith.constant dense<-3.40282347E+38> : tensor<6x6xf32>
    %7 = "tosa.const"() <{value = dense<[0, 1, 2, 3, 4, 5]> : tensor<6xi64>}> : () -> tensor<6xi64>
    %8 = "tosa.const"() <{value = dense<1> : tensor<6xi64>}> : () -> tensor<6xi64>
    %9 = tosa.add %7, %8 : (tensor<6xi64>, tensor<6xi64>) -> tensor<6xi64>
    %10 = tosa.reshape %9 {new_shape = array<i64: 6, 1>} : (tensor<6xi64>) -> tensor<6x1xi64>
    %11 = tensor.empty() : tensor<6x6xi1>
    %12 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction"]} ins(%7, %10 : tensor<6xi64>, tensor<6x1xi64>) outs(%11 : tensor<6x6xi1>) {
    ^bb0(%in: i64, %in_807: i64, %out: i1):
      %3850 = arith.cmpi slt, %in, %in_807 : i64
      linalg.yield %3850 : i1
    } -> tensor<6x6xi1>
    %cst_1 = arith.constant 0.000000e+00 : f32
    %13 = tensor.empty() : tensor<6x6xf32>
    %14 = linalg.generic {indexing_maps = [#map3, #map3, #map3], iterator_types = ["parallel", "parallel"]} ins(%12, %cst_0 : tensor<6x6xi1>, tensor<6x6xf32>) outs(%13 : tensor<6x6xf32>) {
    ^bb0(%in: i1, %in_807: f32, %out: f32):
      %3850 = arith.select %in, %cst_1, %in_807 : f32
      linalg.yield %3850 : f32
    } -> tensor<6x6xf32>
    %extracted_slice = tensor.extract_slice %cst[0, 0] [1, 6] [1, 1] : tensor<1x6xi1> to tensor<1x6xi1>
    %15 = tosa.reshape %extracted_slice {new_shape = array<i64: 1, 1, 6>} : (tensor<1x6xi1>) -> tensor<1x1x6xi1>
    %16 = tosa.reshape %15 {new_shape = array<i64: 1, 1, 1, 6>} : (tensor<1x1x6xi1>) -> tensor<1x1x1x6xi1>
    %extracted_slice_2 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 1, 6] [1, 1, 1, 1] : tensor<1x1x1x6xi1> to tensor<1x1x1x6xi1>
    %17 = "tosa.const"() <{value = dense<false> : tensor<1x1x6x6xi1>}> : () -> tensor<1x1x6x6xi1>
    %18 = tosa.add %extracted_slice_2, %17 : (tensor<1x1x1x6xi1>, tensor<1x1x6x6xi1>) -> tensor<1x1x6x6xi1>
    %19 = tosa.cast %18 : (tensor<1x1x6x6xi1>) -> tensor<1x1x6x6xf32>
    %20 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x1x6x6xf32>}> : () -> tensor<1x1x6x6xf32>
    %21 = tosa.sub %20, %19 : (tensor<1x1x6x6xf32>, tensor<1x1x6x6xf32>) -> tensor<1x1x6x6xf32>
    %22 = tosa.cast %21 : (tensor<1x1x6x6xf32>) -> tensor<1x1x6x6xi1>
    %cst_3 = arith.constant -3.40282347E+38 : f32
    %23 = tensor.empty() : tensor<1x1x6x6xf32>
    %24 = linalg.generic {indexing_maps = [#map4, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%22, %21 : tensor<1x1x6x6xi1>, tensor<1x1x6x6xf32>) outs(%23 : tensor<1x1x6x6xf32>) {
    ^bb0(%in: i1, %in_807: f32, %out: f32):
      %3850 = arith.select %in, %cst_3, %in_807 : f32
      linalg.yield %3850 : f32
    } -> tensor<1x1x6x6xf32>
    %25 = tosa.reshape %14 {new_shape = array<i64: 1, 6, 6>} : (tensor<6x6xf32>) -> tensor<1x6x6xf32>
    %26 = tosa.reshape %25 {new_shape = array<i64: 1, 1, 6, 6>} : (tensor<1x6x6xf32>) -> tensor<1x1x6x6xf32>
    %extracted_slice_4 = tensor.extract_slice %26[0, 0, 0, 0] [1, 1, 6, 6] [1, 1, 1, 1] : tensor<1x1x6x6xf32> to tensor<1x1x6x6xf32>
    %extracted_slice_5 = tensor.extract_slice %extracted_slice_4[0, 0, 0, 0] [1, 1, 6, 6] [1, 1, 1, 1] : tensor<1x1x6x6xf32> to tensor<1x1x6x6xf32>
    %27 = tosa.add %24, %extracted_slice_5 : (tensor<1x1x6x6xf32>, tensor<1x1x6x6xf32>) -> tensor<1x1x6x6xf32>
    %28 = tensor.empty() : tensor<1x6x4096xf32>
    %c2_i32 = arith.constant 2 : i32
    %29 = linalg.generic {indexing_maps = [#map5, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%6 : tensor<1x6x4096xf32>) outs(%28 : tensor<1x6x4096xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3850 = math.fpowi %in, %c2_i32 : f32, i32
      linalg.yield %3850 : f32
    } -> tensor<1x6x4096xf32>
    %cst_6 = arith.constant dense<0.000000e+00> : tensor<1x6x1xf32>
    %30 = linalg.generic {indexing_maps = [#map6, #map7], iterator_types = ["parallel", "parallel", "reduction", "parallel"]} ins(%29 : tensor<1x6x4096xf32>) outs(%cst_6 : tensor<1x6x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst_807 = arith.constant 4.096000e+03 : f32
      %3850 = arith.divf %in, %cst_807 : f32
      %3851 = arith.addf %3850, %out : f32
      linalg.yield %3851 : f32
    } -> tensor<1x6x1xf32>
    %31 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x6x1xf32>}> : () -> tensor<1x6x1xf32>
    %32 = tosa.add %30, %31 : (tensor<1x6x1xf32>, tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %33 = tosa.rsqrt %32 : (tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %34 = tosa.mul %6, %33 {shift = 0 : i8} : (tensor<1x6x4096xf32>, tensor<1x6x1xf32>) -> tensor<1x6x4096xf32>
    %35 = tosa.reshape %arg0 {new_shape = array<i64: 1, 1, 4096>} : (tensor<4096xf32>) -> tensor<1x1x4096xf32>
    %36 = tosa.mul %35, %34 {shift = 0 : i8} : (tensor<1x1x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %37 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %38 = tosa.transpose %arg66, %37 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %39 = tosa.reshape %36 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_7 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %40 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%39, %38 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_7 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %41 = tosa.reshape %40 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %42 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %43 = tosa.transpose %arg67, %42 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %44 = tosa.reshape %36 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_8 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %45 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%44, %43 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_8 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %46 = tosa.identity %45 : (tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %47 = tosa.reshape %45 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %48 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %49 = tosa.transpose %arg68, %48 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %50 = tosa.reshape %36 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_9 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %51 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%50, %49 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_9 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %52 = tosa.identity %51 : (tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %53 = tosa.reshape %51 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %54 = tosa.reshape %41 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %55 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %56 = tosa.transpose %54, %55 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %57 = tosa.reshape %47 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %58 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %59 = tosa.transpose %57, %58 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %60 = tosa.reshape %53 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %61 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %62 = tosa.transpose %60, %61 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_10 = tensor.extract_slice %arg291[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_11 = tensor.extract_slice %extracted_slice_10[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_12 = tensor.extract_slice %extracted_slice_11[0, 0, 0, 0] [1, 1, 6, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x6x128xf32>
    %extracted_slice_13 = tensor.extract_slice %arg292[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_14 = tensor.extract_slice %extracted_slice_13[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_15 = tensor.extract_slice %extracted_slice_14[0, 0, 0, 0] [1, 1, 6, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x6x128xf32>
    %63 = tensor.empty() : tensor<1x6x128xf32>
    %64 = linalg.generic {indexing_maps = [#map8, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%extracted_slice_12 : tensor<1x1x6x128xf32>) outs(%63 : tensor<1x6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x6x128xf32>
    %65 = tensor.empty() : tensor<6x128xf32>
    %66 = linalg.generic {indexing_maps = [#map9, #map3], iterator_types = ["parallel", "parallel"]} ins(%64 : tensor<1x6x128xf32>) outs(%65 : tensor<6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<6x128xf32>
    %67 = tensor.empty() : tensor<1x6x128xf32>
    %68 = linalg.generic {indexing_maps = [#map8, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%extracted_slice_15 : tensor<1x1x6x128xf32>) outs(%67 : tensor<1x6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x6x128xf32>
    %69 = tensor.empty() : tensor<6x128xf32>
    %70 = linalg.generic {indexing_maps = [#map9, #map3], iterator_types = ["parallel", "parallel"]} ins(%68 : tensor<1x6x128xf32>) outs(%69 : tensor<6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<6x128xf32>
    %71 = tensor.empty() : tensor<1x6x128xf32>
    %72 = linalg.generic {indexing_maps = [#map2, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%2 : tensor<1x6xi64>) outs(%71 : tensor<1x6x128xf32>) {
    ^bb0(%in: i64, %out: f32):
      %3850 = arith.index_cast %in : i64 to index
      %3851 = linalg.index 2 : index
      %extracted = tensor.extract %66[%3850, %3851] : tensor<6x128xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x6x128xf32>
    %73 = tosa.reshape %72 {new_shape = array<i64: 1, 1, 6, 128>} : (tensor<1x6x128xf32>) -> tensor<1x1x6x128xf32>
    %74 = tensor.empty() : tensor<1x6x128xf32>
    %75 = linalg.generic {indexing_maps = [#map2, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%2 : tensor<1x6xi64>) outs(%74 : tensor<1x6x128xf32>) {
    ^bb0(%in: i64, %out: f32):
      %3850 = arith.index_cast %in : i64 to index
      %3851 = linalg.index 2 : index
      %extracted = tensor.extract %70[%3850, %3851] : tensor<6x128xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x6x128xf32>
    %76 = tosa.reshape %75 {new_shape = array<i64: 1, 1, 6, 128>} : (tensor<1x6x128xf32>) -> tensor<1x1x6x128xf32>
    %77 = tosa.mul %56, %73 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_16 = tensor.extract_slice %56[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %extracted_slice_17 = tensor.extract_slice %56[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %78 = tensor.empty() : tensor<1x32x6x64xf32>
    %79 = linalg.negf ins(%extracted_slice_17 : tensor<1x32x6x64xf32>) outs(%78 : tensor<1x32x6x64xf32>) -> tensor<1x32x6x64xf32>
    %80 = tensor.empty() : tensor<1x32x6x128xf32>
    %inserted_slice = tensor.insert_slice %79 into %80[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %inserted_slice_18 = tensor.insert_slice %extracted_slice_16 into %inserted_slice[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %81 = tosa.mul %inserted_slice_18, %76 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %82 = tosa.add %77, %81 : (tensor<1x32x6x128xf32>, tensor<1x32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %83 = tosa.mul %59, %73 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_19 = tensor.extract_slice %59[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %extracted_slice_20 = tensor.extract_slice %59[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %84 = tensor.empty() : tensor<1x32x6x64xf32>
    %85 = linalg.negf ins(%extracted_slice_20 : tensor<1x32x6x64xf32>) outs(%84 : tensor<1x32x6x64xf32>) -> tensor<1x32x6x64xf32>
    %86 = tensor.empty() : tensor<1x32x6x128xf32>
    %inserted_slice_21 = tensor.insert_slice %85 into %86[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %inserted_slice_22 = tensor.insert_slice %extracted_slice_19 into %inserted_slice_21[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %87 = tosa.mul %inserted_slice_22, %76 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %88 = tosa.add %83, %87 : (tensor<1x32x6x128xf32>, tensor<1x32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %89 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %90 = tosa.transpose %88, %89 : (tensor<1x32x6x128xf32>, tensor<4xi32>) -> tensor<1x32x128x6xf32>
    %91 = tosa.reshape %82 {new_shape = array<i64: 32, 6, 128>} : (tensor<1x32x6x128xf32>) -> tensor<32x6x128xf32>
    %92 = tosa.reshape %90 {new_shape = array<i64: 32, 128, 6>} : (tensor<1x32x128x6xf32>) -> tensor<32x128x6xf32>
    %93 = tosa.matmul %91, %92 : (tensor<32x6x128xf32>, tensor<32x128x6xf32>) -> tensor<32x6x6xf32>
    %94 = tosa.reshape %93 {new_shape = array<i64: 1, 32, 6, 6>} : (tensor<32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %95 = "tosa.const"() <{value = dense<11.3137083> : tensor<1x32x6x6xf32>}> : () -> tensor<1x32x6x6xf32>
    %96 = tosa.reciprocal %95 : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %97 = tosa.mul %94, %96 {shift = 0 : i8} : (tensor<1x32x6x6xf32>, tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %98 = tosa.add %97, %27 : (tensor<1x32x6x6xf32>, tensor<1x1x6x6xf32>) -> tensor<1x32x6x6xf32>
    %99 = tosa.reduce_max %98 {axis = 3 : i32} : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x1xf32>
    %100 = tosa.sub %98, %99 : (tensor<1x32x6x6xf32>, tensor<1x32x6x1xf32>) -> tensor<1x32x6x6xf32>
    %101 = tosa.exp %100 : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %102 = tosa.reduce_sum %101 {axis = 3 : i32} : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x1xf32>
    %103 = tosa.reciprocal %102 : (tensor<1x32x6x1xf32>) -> tensor<1x32x6x1xf32>
    %104 = tosa.mul %101, %103 {shift = 0 : i8} : (tensor<1x32x6x6xf32>, tensor<1x32x6x1xf32>) -> tensor<1x32x6x6xf32>
    %105 = tosa.reshape %104 {new_shape = array<i64: 32, 6, 6>} : (tensor<1x32x6x6xf32>) -> tensor<32x6x6xf32>
    %106 = tosa.reshape %62 {new_shape = array<i64: 32, 6, 128>} : (tensor<1x32x6x128xf32>) -> tensor<32x6x128xf32>
    %107 = tosa.matmul %105, %106 : (tensor<32x6x6xf32>, tensor<32x6x128xf32>) -> tensor<32x6x128xf32>
    %108 = tosa.reshape %107 {new_shape = array<i64: 1, 32, 6, 128>} : (tensor<32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %109 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %110 = tosa.transpose %108, %109 : (tensor<1x32x6x128xf32>, tensor<4xi32>) -> tensor<1x6x32x128xf32>
    %111 = tosa.identity %110 : (tensor<1x6x32x128xf32>) -> tensor<1x6x32x128xf32>
    %112 = tosa.reshape %111 {new_shape = array<i64: 1, 6, 4096>} : (tensor<1x6x32x128xf32>) -> tensor<1x6x4096xf32>
    %113 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %114 = tosa.transpose %arg69, %113 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %115 = tosa.reshape %112 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_23 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %116 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%115, %114 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_23 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %117 = tosa.reshape %116 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %118 = tosa.add %6, %117 : (tensor<1x6x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %119 = tensor.empty() : tensor<1x6x4096xf32>
    %c2_i32_24 = arith.constant 2 : i32
    %120 = linalg.generic {indexing_maps = [#map5, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%118 : tensor<1x6x4096xf32>) outs(%119 : tensor<1x6x4096xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3850 = math.fpowi %in, %c2_i32_24 : f32, i32
      linalg.yield %3850 : f32
    } -> tensor<1x6x4096xf32>
    %cst_25 = arith.constant dense<0.000000e+00> : tensor<1x6x1xf32>
    %121 = linalg.generic {indexing_maps = [#map6, #map7], iterator_types = ["parallel", "parallel", "reduction", "parallel"]} ins(%120 : tensor<1x6x4096xf32>) outs(%cst_25 : tensor<1x6x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst_807 = arith.constant 4.096000e+03 : f32
      %3850 = arith.divf %in, %cst_807 : f32
      %3851 = arith.addf %3850, %out : f32
      linalg.yield %3851 : f32
    } -> tensor<1x6x1xf32>
    %122 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x6x1xf32>}> : () -> tensor<1x6x1xf32>
    %123 = tosa.add %121, %122 : (tensor<1x6x1xf32>, tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %124 = tosa.rsqrt %123 : (tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %125 = tosa.mul %118, %124 {shift = 0 : i8} : (tensor<1x6x4096xf32>, tensor<1x6x1xf32>) -> tensor<1x6x4096xf32>
    %126 = tosa.reshape %arg1 {new_shape = array<i64: 1, 1, 4096>} : (tensor<4096xf32>) -> tensor<1x1x4096xf32>
    %127 = tosa.mul %126, %125 {shift = 0 : i8} : (tensor<1x1x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %128 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %129 = tosa.transpose %arg70, %128 : (tensor<11008x4096xf32>, tensor<2xi32>) -> tensor<4096x11008xf32>
    %130 = tosa.reshape %127 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_26 = arith.constant dense<0.000000e+00> : tensor<6x11008xf32>
    %131 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%130, %129 : tensor<6x4096xf32>, tensor<4096x11008xf32>) outs(%cst_26 : tensor<6x11008xf32>) -> tensor<6x11008xf32>
    %132 = tosa.reshape %131 {new_shape = array<i64: 1, 6, 11008>} : (tensor<6x11008xf32>) -> tensor<1x6x11008xf32>
    %133 = tosa.sigmoid %132 : (tensor<1x6x11008xf32>) -> tensor<1x6x11008xf32>
    %134 = tosa.mul %132, %133 {shift = 0 : i8} : (tensor<1x6x11008xf32>, tensor<1x6x11008xf32>) -> tensor<1x6x11008xf32>
    %135 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %136 = tosa.transpose %arg71, %135 : (tensor<11008x4096xf32>, tensor<2xi32>) -> tensor<4096x11008xf32>
    %137 = tosa.reshape %127 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_27 = arith.constant dense<0.000000e+00> : tensor<6x11008xf32>
    %138 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%137, %136 : tensor<6x4096xf32>, tensor<4096x11008xf32>) outs(%cst_27 : tensor<6x11008xf32>) -> tensor<6x11008xf32>
    %139 = tosa.reshape %138 {new_shape = array<i64: 1, 6, 11008>} : (tensor<6x11008xf32>) -> tensor<1x6x11008xf32>
    %140 = tosa.mul %134, %139 {shift = 0 : i8} : (tensor<1x6x11008xf32>, tensor<1x6x11008xf32>) -> tensor<1x6x11008xf32>
    %141 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %142 = tosa.transpose %arg72, %141 : (tensor<4096x11008xf32>, tensor<2xi32>) -> tensor<11008x4096xf32>
    %143 = tosa.reshape %140 {new_shape = array<i64: 6, 11008>} : (tensor<1x6x11008xf32>) -> tensor<6x11008xf32>
    %cst_28 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %144 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%143, %142 : tensor<6x11008xf32>, tensor<11008x4096xf32>) outs(%cst_28 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %145 = tosa.reshape %144 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %146 = tosa.add %118, %145 : (tensor<1x6x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %147 = tensor.empty() : tensor<1x6x4096xf32>
    %c2_i32_29 = arith.constant 2 : i32
    %148 = linalg.generic {indexing_maps = [#map5, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%146 : tensor<1x6x4096xf32>) outs(%147 : tensor<1x6x4096xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3850 = math.fpowi %in, %c2_i32_29 : f32, i32
      linalg.yield %3850 : f32
    } -> tensor<1x6x4096xf32>
    %cst_30 = arith.constant dense<0.000000e+00> : tensor<1x6x1xf32>
    %149 = linalg.generic {indexing_maps = [#map6, #map7], iterator_types = ["parallel", "parallel", "reduction", "parallel"]} ins(%148 : tensor<1x6x4096xf32>) outs(%cst_30 : tensor<1x6x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst_807 = arith.constant 4.096000e+03 : f32
      %3850 = arith.divf %in, %cst_807 : f32
      %3851 = arith.addf %3850, %out : f32
      linalg.yield %3851 : f32
    } -> tensor<1x6x1xf32>
    %150 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x6x1xf32>}> : () -> tensor<1x6x1xf32>
    %151 = tosa.add %149, %150 : (tensor<1x6x1xf32>, tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %152 = tosa.rsqrt %151 : (tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %153 = tosa.mul %146, %152 {shift = 0 : i8} : (tensor<1x6x4096xf32>, tensor<1x6x1xf32>) -> tensor<1x6x4096xf32>
    %154 = tosa.reshape %arg2 {new_shape = array<i64: 1, 1, 4096>} : (tensor<4096xf32>) -> tensor<1x1x4096xf32>
    %155 = tosa.mul %154, %153 {shift = 0 : i8} : (tensor<1x1x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %156 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %157 = tosa.transpose %arg73, %156 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %158 = tosa.reshape %155 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_31 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %159 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%158, %157 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_31 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %160 = tosa.reshape %159 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %161 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %162 = tosa.transpose %arg74, %161 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %163 = tosa.reshape %155 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_32 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %164 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%163, %162 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_32 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %165 = tosa.identity %164 : (tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %166 = tosa.reshape %164 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %167 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %168 = tosa.transpose %arg75, %167 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %169 = tosa.reshape %155 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_33 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %170 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%169, %168 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_33 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %171 = tosa.identity %170 : (tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %172 = tosa.reshape %170 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %173 = tosa.reshape %160 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %174 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %175 = tosa.transpose %173, %174 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %176 = tosa.reshape %166 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %177 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %178 = tosa.transpose %176, %177 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %179 = tosa.reshape %172 {new_shape = array<i64: 1, 6, 32, 128>} : (tensor<1x6x4096xf32>) -> tensor<1x6x32x128xf32>
    %180 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %181 = tosa.transpose %179, %180 : (tensor<1x6x32x128xf32>, tensor<4xi32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_34 = tensor.extract_slice %arg293[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_35 = tensor.extract_slice %extracted_slice_34[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_36 = tensor.extract_slice %extracted_slice_35[0, 0, 0, 0] [1, 1, 6, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x6x128xf32>
    %extracted_slice_37 = tensor.extract_slice %arg294[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_38 = tensor.extract_slice %extracted_slice_37[0, 0, 0, 0] [1, 1, 2048, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x2048x128xf32>
    %extracted_slice_39 = tensor.extract_slice %extracted_slice_38[0, 0, 0, 0] [1, 1, 6, 128] [1, 1, 1, 1] : tensor<1x1x2048x128xf32> to tensor<1x1x6x128xf32>
    %182 = tensor.empty() : tensor<1x6x128xf32>
    %183 = linalg.generic {indexing_maps = [#map8, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%extracted_slice_36 : tensor<1x1x6x128xf32>) outs(%182 : tensor<1x6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x6x128xf32>
    %184 = tensor.empty() : tensor<6x128xf32>
    %185 = linalg.generic {indexing_maps = [#map9, #map3], iterator_types = ["parallel", "parallel"]} ins(%183 : tensor<1x6x128xf32>) outs(%184 : tensor<6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<6x128xf32>
    %186 = tensor.empty() : tensor<1x6x128xf32>
    %187 = linalg.generic {indexing_maps = [#map8, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%extracted_slice_39 : tensor<1x1x6x128xf32>) outs(%186 : tensor<1x6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x6x128xf32>
    %188 = tensor.empty() : tensor<6x128xf32>
    %189 = linalg.generic {indexing_maps = [#map9, #map3], iterator_types = ["parallel", "parallel"]} ins(%187 : tensor<1x6x128xf32>) outs(%188 : tensor<6x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<6x128xf32>
    %190 = tensor.empty() : tensor<1x6x128xf32>
    %191 = linalg.generic {indexing_maps = [#map2, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%2 : tensor<1x6xi64>) outs(%190 : tensor<1x6x128xf32>) {
    ^bb0(%in: i64, %out: f32):
      %3850 = arith.index_cast %in : i64 to index
      %3851 = linalg.index 2 : index
      %extracted = tensor.extract %185[%3850, %3851] : tensor<6x128xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x6x128xf32>
    %192 = tosa.reshape %191 {new_shape = array<i64: 1, 1, 6, 128>} : (tensor<1x6x128xf32>) -> tensor<1x1x6x128xf32>
    %193 = tensor.empty() : tensor<1x6x128xf32>
    %194 = linalg.generic {indexing_maps = [#map2, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%2 : tensor<1x6xi64>) outs(%193 : tensor<1x6x128xf32>) {
    ^bb0(%in: i64, %out: f32):
      %3850 = arith.index_cast %in : i64 to index
      %3851 = linalg.index 2 : index
      %extracted = tensor.extract %189[%3850, %3851] : tensor<6x128xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x6x128xf32>
    %195 = tosa.reshape %194 {new_shape = array<i64: 1, 1, 6, 128>} : (tensor<1x6x128xf32>) -> tensor<1x1x6x128xf32>
    %196 = tosa.mul %175, %192 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_40 = tensor.extract_slice %175[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %extracted_slice_41 = tensor.extract_slice %175[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %197 = tensor.empty() : tensor<1x32x6x64xf32>
    %198 = linalg.negf ins(%extracted_slice_41 : tensor<1x32x6x64xf32>) outs(%197 : tensor<1x32x6x64xf32>) -> tensor<1x32x6x64xf32>
    %199 = tensor.empty() : tensor<1x32x6x128xf32>
    %inserted_slice_42 = tensor.insert_slice %198 into %199[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %inserted_slice_43 = tensor.insert_slice %extracted_slice_40 into %inserted_slice_42[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %200 = tosa.mul %inserted_slice_43, %195 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %201 = tosa.add %196, %200 : (tensor<1x32x6x128xf32>, tensor<1x32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %202 = tosa.mul %178, %192 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %extracted_slice_44 = tensor.extract_slice %178[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %extracted_slice_45 = tensor.extract_slice %178[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x128xf32> to tensor<1x32x6x64xf32>
    %203 = tensor.empty() : tensor<1x32x6x64xf32>
    %204 = linalg.negf ins(%extracted_slice_45 : tensor<1x32x6x64xf32>) outs(%203 : tensor<1x32x6x64xf32>) -> tensor<1x32x6x64xf32>
    %205 = tensor.empty() : tensor<1x32x6x128xf32>
    %inserted_slice_46 = tensor.insert_slice %204 into %205[0, 0, 0, 0] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %inserted_slice_47 = tensor.insert_slice %extracted_slice_44 into %inserted_slice_46[0, 0, 0, 64] [1, 32, 6, 64] [1, 1, 1, 1] : tensor<1x32x6x64xf32> into tensor<1x32x6x128xf32>
    %206 = tosa.mul %inserted_slice_47, %195 {shift = 0 : i8} : (tensor<1x32x6x128xf32>, tensor<1x1x6x128xf32>) -> tensor<1x32x6x128xf32>
    %207 = tosa.add %202, %206 : (tensor<1x32x6x128xf32>, tensor<1x32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %208 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %209 = tosa.transpose %207, %208 : (tensor<1x32x6x128xf32>, tensor<4xi32>) -> tensor<1x32x128x6xf32>
    %210 = tosa.reshape %201 {new_shape = array<i64: 32, 6, 128>} : (tensor<1x32x6x128xf32>) -> tensor<32x6x128xf32>
    %211 = tosa.reshape %209 {new_shape = array<i64: 32, 128, 6>} : (tensor<1x32x128x6xf32>) -> tensor<32x128x6xf32>
    %212 = tosa.matmul %210, %211 : (tensor<32x6x128xf32>, tensor<32x128x6xf32>) -> tensor<32x6x6xf32>
    %213 = tosa.reshape %212 {new_shape = array<i64: 1, 32, 6, 6>} : (tensor<32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %214 = "tosa.const"() <{value = dense<11.3137083> : tensor<1x32x6x6xf32>}> : () -> tensor<1x32x6x6xf32>
    %215 = tosa.reciprocal %214 : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %216 = tosa.mul %213, %215 {shift = 0 : i8} : (tensor<1x32x6x6xf32>, tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %217 = tosa.add %216, %27 : (tensor<1x32x6x6xf32>, tensor<1x1x6x6xf32>) -> tensor<1x32x6x6xf32>
    %218 = tosa.reduce_max %217 {axis = 3 : i32} : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x1xf32>
    %219 = tosa.sub %217, %218 : (tensor<1x32x6x6xf32>, tensor<1x32x6x1xf32>) -> tensor<1x32x6x6xf32>
    %220 = tosa.exp %219 : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x6xf32>
    %221 = tosa.reduce_sum %220 {axis = 3 : i32} : (tensor<1x32x6x6xf32>) -> tensor<1x32x6x1xf32>
    %222 = tosa.reciprocal %221 : (tensor<1x32x6x1xf32>) -> tensor<1x32x6x1xf32>
    %223 = tosa.mul %220, %222 {shift = 0 : i8} : (tensor<1x32x6x6xf32>, tensor<1x32x6x1xf32>) -> tensor<1x32x6x6xf32>
    %224 = tosa.reshape %223 {new_shape = array<i64: 32, 6, 6>} : (tensor<1x32x6x6xf32>) -> tensor<32x6x6xf32>
    %225 = tosa.reshape %181 {new_shape = array<i64: 32, 6, 128>} : (tensor<1x32x6x128xf32>) -> tensor<32x6x128xf32>
    %226 = tosa.matmul %224, %225 : (tensor<32x6x6xf32>, tensor<32x6x128xf32>) -> tensor<32x6x128xf32>
    %227 = tosa.reshape %226 {new_shape = array<i64: 1, 32, 6, 128>} : (tensor<32x6x128xf32>) -> tensor<1x32x6x128xf32>
    %228 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %229 = tosa.transpose %227, %228 : (tensor<1x32x6x128xf32>, tensor<4xi32>) -> tensor<1x6x32x128xf32>
    %230 = tosa.identity %229 : (tensor<1x6x32x128xf32>) -> tensor<1x6x32x128xf32>
    %231 = tosa.reshape %230 {new_shape = array<i64: 1, 6, 4096>} : (tensor<1x6x32x128xf32>) -> tensor<1x6x4096xf32>
    %232 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %233 = tosa.transpose %arg76, %232 : (tensor<4096x4096xf32>, tensor<2xi32>) -> tensor<4096x4096xf32>
    %234 = tosa.reshape %231 {new_shape = array<i64: 6, 4096>} : (tensor<1x6x4096xf32>) -> tensor<6x4096xf32>
    %cst_48 = arith.constant dense<0.000000e+00> : tensor<6x4096xf32>
    %235 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%234, %233 : tensor<6x4096xf32>, tensor<4096x4096xf32>) outs(%cst_48 : tensor<6x4096xf32>) -> tensor<6x4096xf32>
    %236 = tosa.reshape %235 {new_shape = array<i64: 1, 6, 4096>} : (tensor<6x4096xf32>) -> tensor<1x6x4096xf32>
    %237 = tosa.add %146, %236 : (tensor<1x6x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
    %238 = tensor.empty() : tensor<1x6x4096xf32>
    %c2_i32_49 = arith.constant 2 : i32
    %239 = linalg.generic {indexing_maps = [#map5, #map5], iterator_types = ["parallel", "parallel", "parallel"]} ins(%237 : tensor<1x6x4096xf32>) outs(%238 : tensor<1x6x4096xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3850 = math.fpowi %in, %c2_i32_49 : f32, i32
      linalg.yield %3850 : f32
    } -> tensor<1x6x4096xf32>
    %cst_50 = arith.constant dense<0.000000e+00> : tensor<1x6x1xf32>
    %240 = linalg.generic {indexing_maps = [#map6, #map7], iterator_types = ["parallel", "parallel", "reduction", "parallel"]} ins(%239 : tensor<1x6x4096xf32>) outs(%cst_50 : tensor<1x6x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %cst_807 = arith.constant 4.096000e+03 : f32
      %3850 = arith.divf %in, %cst_807 : f32
      %3851 = arith.addf %3850, %out : f32
      linalg.yield %3851 : f32
    } -> tensor<1x6x1xf32>
    %241 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x6x1xf32>}> : () -> tensor<1x6x1xf32>
    %242 = tosa.add %240, %241 : (tensor<1x6x1xf32>, tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %243 = tosa.rsqrt %242 : (tensor<1x6x1xf32>) -> tensor<1x6x1xf32>
    %244 = tosa.mul %237, %243 {shift = 0 : i8} : (tensor<1x6x4096xf32>, tensor<1x6x1xf32>) -> tensor<1x6x4096xf32>
    %245 = tosa.reshape %arg3 {new_shape = array<i64: 1, 1, 4096>} : (tensor<4096xf32>) -> tensor<1x1x4096xf32>
    %246 = tosa.mul %245, %244 {shift = 0 : i8} : (tensor<1x1x4096xf32>, tensor<1x6x4096xf32>) -> tensor<1x6x4096xf32>
